Revit 2026 API

# TabbedDialogExtensionOnRestoreDefaultsAction Property

---

The restore defaults handler.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TabbedDialogAction OnRestoreDefaultsAction { get; set; }
```
```vb
Public Property OnRestoreDefaultsAction As TabbedDialogAction
	Get
	Set
```
```cpp
public:
property TabbedDialogAction^ OnRestoreDefaultsAction {
	TabbedDialogAction^ get ();
	void set (TabbedDialogAction^ value);
}
```
```fsharp
member OnRestoreDefaultsAction : TabbedDialogAction with get, set
```

#### Property Value

TabbedDialogAction

This handler will be invoked when the "Restore Defaults" button in Revit options dialog is clicked and the handler should apply only to options set on this page. There is no "Restore Defaults" button in Revit options dialog if this property was set to .

#### Reference

TabbedDialogExtension Class

Autodesk.Revit.UI Namespace